# Basic Taps
tap 'homebrew/dupes'

# Cask + alt versions 
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'brew-cask'

# Install GNU utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
brew 'moreutils'
'# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed'
brew 'findutils'

# Install more recent versions of some OS X tools
# Don't forget to add /usr/local/bin/bash to /etc/shells
brew 'bash'
brew 'bash-completion'
brew 'vim', args: ['override-system-vi']
brew 'grep'
brew 'screen'

## PHP
#tap 'homebrew/homebrew-php'
#brew 'homebrew/php/php55'

brew 'curl', args: ['with-libssh2']
brew 'direnv'
brew 'git'
brew 'hub'
brew 'imagemagick', args: ['with-webp']
brew 'node'
#brew 'nvm'
brew 'openssl'
brew 'pianobar'
brew 'rename'
brew 'rsync'
brew 'ssh-copy-id'
brew 'tree'
brew 'wget', args: ['with-iri', 'with-debug']
brew 'z'

# Pythons
brew 'python'
brew 'python3'

# Casks
cask 'cheatsheet'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'slack'
cask 'slate'
cask 'vlc'
